package prakt2.work1;
public class Shape{ //класс Фигуры
    public String shape;//название Фигуры в свойствах
    public int P;//Площадь фигуры в свойствах
    public int S;//Периметр фигуры в свойствах
    public Shape(String shape,int P,int S){ //Конструктор класса Фигуры с вводом Названия фигуры, Периметр, Площадь
        this.shape=shape;//Обновление Названия фигуры
        this.P=P;//Обновление Периметра фигуры
        this.S=S;//Обновление Площади фигуры
    }
    public String ShapeLine(){//Функция вывода данных Фигуры
        return ("=/____________________________/="+"\n"+"==//= shape: "+"[_"+this.shape+"_] =//=="+"\n"+"==//= P = "+"[_"+this.P+"_] =//=="+"\n"+"==//= S = "+"[_"+this.S+"_] =//=="+"\n"+"=/____________________________/=");
    }

}